/***********************************************************************************************************
*   完成内容：文件的读写、条目的增加、删除与显示                                                           *
*   最后修改时间： 2017/5/28 20：45                                                                        *
*   修改日志记录：                                                                                         *
*   2017/4/17 22：23     刘子琦     完成了 主窗体的创建、文字渲染                                          *
*   2017/4/21 21：00     刘子琦     完成了 按钮的设置、用文本渲染进行简单的输出                            *                                                *
*   2017/4/21 22：47     刘子琦     完成了 链表的内置、读写函数的导入									   *
*   2017/5/15 21：29     刘子琦     完成了 列表框的设置，对列表框进行输出、删除调试                        *
*   2017/5/21 23：00     刘子琦     完成了 链表与窗体数据的初步对接                                        *
*   2017/5/28 20：45     刘子琦     完成了 按钮触发模态对话框的设置                                        *
*   历史文件保存在的位置  D:/data.txt                                                                      *
************************************************************************************************************/
